RT-Thread/rt-thread/bsp/stm32/libraries/STM32MPxx_HAL/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_ll_tim.h
/** @defgroup TIM_LL_EC_DMABURST_BASEADDR DMA Burst Base Address
  * @{
  */
#define LL_TIM_DMABURST_BASEADDR_CR1           0x00000000U                                                      /*!< TIMx_CR1 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CR2           TIM_DCR_DBA_0                                                    /*!< TIMx_CR2 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_SMCR          TIM_DCR_DBA_1                                                    /*!< TIMx_SMCR register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_DIER          (TIM_DCR_DBA_1 |  TIM_DCR_DBA_0)                                 /*!< TIMx_DIER register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_SR            TIM_DCR_DBA_2                                                    /*!< TIMx_SR register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_EGR           (TIM_DCR_DBA_2 | TIM_DCR_DBA_0)                                  /*!< TIMx_EGR register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR1         (TIM_DCR_DBA_2 | TIM_DCR_DBA_1)                                  /*!< TIMx_CCMR1 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR2         (TIM_DCR_DBA_2 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)                  /*!< TIMx_CCMR2 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCER          TIM_DCR_DBA_3                                                    /*!< TIMx_CCER register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CNT           (TIM_DCR_DBA_3 | TIM_DCR_DBA_0)                                  /*!< TIMx_CNT register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_PSC           (TIM_DCR_DBA_3 | TIM_DCR_DBA_1)                                  /*!< TIMx_PSC register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_ARR           (TIM_DCR_DBA_3 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)                  /*!< TIMx_ARR register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_RCR           (TIM_DCR_DBA_3 | TIM_DCR_DBA_2)                                  /*!< TIMx_RCR register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR1          (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 | TIM_DCR_DBA_0)                  /*!< TIMx_CCR1 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR2          (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1)                  /*!< TIMx_CCR2 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR3          (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)  /*!< TIMx_CCR3 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR4          TIM_DCR_DBA_4                                                    /*!< TIMx_CCR4 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_BDTR          (TIM_DCR_DBA_4 | TIM_DCR_DBA_0)                                  /*!< TIMx_BDTR register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR3         (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 | TIM_DCR_DBA_0)                  /*!< TIMx_CCMR3 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR5          (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1)                  /*!< TIMx_CCR5 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR6          (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)  /*!< TIMx_CCR6 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_AF1           (TIM_DCR_DBA_4 | TIM_DCR_DBA_3)                                  /*!< TIMx_AF1 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_AF2           (TIM_DCR_DBA_4 | TIM_DCR_DBA_3 | TIM_DCR_DBA_0)                  /*!< TIMx_AF2 register is the DMA base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_TISEL         (TIM_DCR_DBA_4 | TIM_DCR_DBA_3 | TIM_DCR_DBA_1)                  /*!< TIMx_TISEL register is the DMA base address for DMA burst */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_DMABURST_LENGTH DMA Burst Length
  * @{
  */
#define LL_TIM_DMABURST_LENGTH_1TRANSFER       0x00000000U                                                     /*!< Transfer is done to 1 register starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_2TRANSFERS      TIM_DCR_DBL_0                                                   /*!< Transfer is done to 2 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_3TRANSFERS      TIM_DCR_DBL_1                                                   /*!< Transfer is done to 3 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_4TRANSFERS      (TIM_DCR_DBL_1 |  TIM_DCR_DBL_0)                                /*!< Transfer is done to 4 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_5TRANSFERS      TIM_DCR_DBL_2                                                   /*!< Transfer is done to 5 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_6TRANSFERS      (TIM_DCR_DBL_2 | TIM_DCR_DBL_0)                                 /*!< Transfer is done to 6 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_7TRANSFERS      (TIM_DCR_DBL_2 | TIM_DCR_DBL_1)                                 /*!< Transfer is done to 7 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_8TRANSFERS      (TIM_DCR_DBL_2 | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)                 /*!< Transfer is done to 1 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_9TRANSFERS      TIM_DCR_DBL_3                                                   /*!< Transfer is done to 9 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_10TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_0)                                 /*!< Transfer is done to 10 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_11TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_1)                                 /*!< Transfer is done to 11 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_12TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)                 /*!< Transfer is done to 12 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_13TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2)                                 /*!< Transfer is done to 13 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_14TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 | TIM_DCR_DBL_0)                 /*!< Transfer is done to 14 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_15TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 | TIM_DCR_DBL_1)                 /*!< Transfer is done to 15 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_16TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 | TIM_DCR_DBL_1 | TIM_DCR_DBL_0) /*!< Transfer is done to 16 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_17TRANSFERS     TIM_DCR_DBL_4                                                   /*!< Transfer is done to 17 registers starting from the DMA burst base address */
#define LL_TIM_DMABURST_LENGTH_18TRANSFERS     (TIM_DCR_DBL_4 |  TIM_DCR_DBL_0)                                /*!< Transfer is done to 18 registers starting from the DMA burst base address */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM1_TIx_RMP  TIM1 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM1_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM1 input 1 is connected to GPIO */
#define LL_TIM_TIM1_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM1 input 2 is connected to GPIO */
#define LL_TIM_TIM1_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM1 input 3 is connected to GPIO */
#define LL_TIM_TIM1_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM1 input 4 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM8_TIx_RMP  TIM8 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM8_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM8 input 1 is connected to GPIO */
#define LL_TIM_TIM8_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM8 input 2 is connected to GPIO */
#define LL_TIM_TIM8_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM8 input 3 is connected to GPIO */
#define LL_TIM_TIM8_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM8 input 4 is connected to GPIO */
/**
  * @}
  */
  /** @defgroup TIM_LL_EC_TIM2_TIx_RMP  TIM2 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM2_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM2 input 1 is connected to GPIO */
#define LL_TIM_TIM2_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM2 input 2 is connected to GPIO */
#define LL_TIM_TIM2_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM2 input 3 is connected to GPIO */
#define LL_TIM_TIM2_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM2 input 4 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM3_TIx_RMP  TIM3 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM3_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 1 is connected to GPIO */
#define LL_TIM_TIM3_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 2 is connected to GPIO */
#define LL_TIM_TIM3_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 3 is connected to GPIO */
#define LL_TIM_TIM3_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 4 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM4_TIx_RMP  TIM4 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM4_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 1 is connected to GPIO */
#define LL_TIM_TIM4_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 2 is connected to GPIO */
#define LL_TIM_TIM4_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 3 is connected to GPIO */
#define LL_TIM_TIM4_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 4 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM5_TIx_RMP  TIM5 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM5_TI1_RMP_GPIO        0x00000000U                                  /*!< TIM5 input 1 is connected to GPIO */
#define LL_TIM_TIM5_TI1_RMP_FDCAN1_TMP  TIM_TISEL_TI1SEL_0                           /*!< TIM5 input 1 is connected to FDCAN1_TMP */
#define LL_TIM_TIM5_TI1_RMP_FDCAN1_RTP  TIM_TISEL_TI1SEL_1                           /*!< TIM5 input 1 is connected to FDCAN1_RTP */
#define LL_TIM_TIM5_TI2_RMP_GPIO        0x00000000U                                  /*!< TIM5 input 2 is connected to GPIO */
#define LL_TIM_TIM5_TI3_RMP_GPIO        0x00000000U                                  /*!< TIM5 input 3 is connected to GPIO */
#define LL_TIM_TIM5_TI4_RMP_GPIO        0x00000000U                                  /*!< TIM5 input 4 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM12_TIx_RMP  TIM12 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM12_TI1_RMP_GPIO         0x00000000U                                 /*!< TIM12 input 1 is connected to GPIO */
#define LL_TIM_TIM12_TI1_RMP_HSI_CAL_CK   TIM_TISEL_TI1SEL_0                          /*!< TIM12 input 1 is connected to HSI_CAL_CK */
#define LL_TIM_TIM12_TI1_RMP_CSI_CAL_CK   TIM_TISEL_TI1SEL_1                          /*!< TIM12 input 1 is connected to CSI_CAL_CK */
#define LL_TIM_TIM12_TI2_RMP_GPIO         0x00000000U                                 /*!< TIM12 input 2 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM13_TIx_RMP  TIM13 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM13_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM13 input 1 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM14_TIx_RMP  TIM14 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM14_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM14 input 1 is connected to GPIO */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM15_TIx_RMP  TIM15 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM15_TI1_RMP_GPIO        0x00000000U                                  /*!< TIM15 input 1 is connected to GPIO */
#define LL_TIM_TIM15_TI1_RMP_TIM2_CH1    TIM_TISEL_TI1SEL_0                           /*!< TIM15 input 1 is connected to TIM2_CH1 */
#define LL_TIM_TIM15_TI1_RMP_TIM3_CH1    TIM_TISEL_TI1SEL_1                           /*!< TIM15 input 1 is connected to TIM3_CH1 */
#define LL_TIM_TIM15_TI1_RMP_TIM4_CH1    (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)    /*!< TIM15 input 1 is connected to TIM4_CH1 */
#define LL_TIM_TIM15_TI1_RMP_RCC_LSE     TIM_TISEL_TI1SEL_2                           /*!< TIM15 input 1 is connected to RCC_LSE  */
#define LL_TIM_TIM15_TI1_RMP_RCC_CSI     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)    /*!< TIM15 input 1 is connected to RCC_CSI  */
#define LL_TIM_TIM15_TI1_RMP_RCC_MCO2    (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)    /*!< TIM15 input 1 is connected to RCC_MCO2 */
#define LL_TIM_TIM15_TI1_RMP_HSI_CAL_CK  (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)    /*!< TIM15 input 1 is connected to HSI_CAL_CK */
#define LL_TIM_TIM15_TI1_RMP_CSI_CAL_CK  TIM_TISEL_TI1SEL_3                           /*!< TIM15 input 1 is connected to CSI_CAL_CK */
#define LL_TIM_TIM15_TI2_RMP_GPIO        0x00000000U                                  /*!< TIM15 input 2 is connected to GPIO */
#define LL_TIM_TIM15_TI2_RMP_TIM2_CH2    TIM_TISEL_TI1SEL_0                           /*!< TIM15 input 2 is connected to TIM2_CH2 */
#define LL_TIM_TIM15_TI2_RMP_TIM3_CH2    TIM_TISEL_TI1SEL_1                           /*!< TIM15 input 2 is connected to TIM3_CH2 */
#define LL_TIM_TIM15_TI2_RMP_TIM4_CH2    (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)    /*!< TIM15 input 2 is connected to TIM4_CH2 */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM16_TIx_RMP  TIM16 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM16_TI1_RMP_GPIO        0x00000000U                                  /*!< TIM16 input 1 is connected to GPIO */
#define LL_TIM_TIM16_TI1_RMP_RCC_LSI     TIM_TISEL_TI1SEL_0                           /*!< TIM16 input 1 is connected to RCC_LSI */
#define LL_TIM_TIM16_TI1_RMP_RCC_LSE     TIM_TISEL_TI1SEL_1                           /*!< TIM16 input 1 is connected to RCC_LSE */
#define LL_TIM_TIM16_TI1_RMP_WKUP_IT     (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)    /*!< TIM16 input 1 is connected to WKUP_IT */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_TIM17_TIx_RMP  TIM17 Timer Input Chx Remap
  * @{
  */
#define LL_TIM_TIM17_TI1_RMP_GPIO         0x00000000U                                  /*!< TIM17 input 1 is connected to GPIO */
#define LL_TIM_TIM17_TI1_RMP_SPDIFRX_FS   TIM_TISEL_TI1SEL_0                           /*!< TIM17 input 1 is connected to SPDIF_FS */
#define LL_TIM_TIM17_TI1_RMP_RCC_HSE_RTC  TIM_TISEL_TI1SEL_1                           /*!< TIM17 input 1 is connected to RCC_HSE_RTC */
#define LL_TIM_TIM17_TI1_RMP_RCC_MCO1     (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)    /*!< TIM17 input 1 is connected to RCC_MCO1 */
/**
  * @}
  */

/** Legacy definitions for compatibility purpose
@cond 0
  */
#define LL_TIM_BKIN_SOURCE_DFBK  LL_TIM_BKIN_SOURCE_DF1BK
/**
@endcond
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TIM_LL_Exported_Macros TIM Exported Macros
  * @{
  */

/** @defgroup TIM_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */
/**
  * @brief  Write a value in TIM register.
  * @param  __INSTANCE__ TIM Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_TIM_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in TIM register.
  * @param  __INSTANCE__ TIM Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_TIM_ReadReg(__INSTANCE__, __REG__) READ_REG((__INSTANCE__)->__REG__)
/**
  * @}
  */

